DELETE FROM user_role;
DELETE FROM meals;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_role (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals(date_time, description, calories, user_id) VALUES
('2020-01-30 10:00', 'Завтрак (User)', 500, 100000),
('2020-01-30 13:00', 'Обед (User)', 1000, 100000),
('2020-01-30 20:00', 'Ужин (User)', 500, 100000),
('2020-01-31 00:00', 'Еда на граничное значение (User)', 100, 100000),
('2020-01-31 10:00', 'Завтрак (User)', 1000, 100000),
('2020-01-31 13:00', 'Обед (User)', 500, 100000),
('2020-01-31 20:00', 'Ужин (User)', 410, 100000),

('2020-01-28 10:00', 'Завтрак (User)', 500, 100000),
('2020-01-28 13:00', 'Обед (User)', 1000, 100000),
('2020-01-28 20:00', 'Ужин (User)', 500, 100000),
('2020-01-29 00:00', 'Еда на граничное значение (User)', 100, 100000),
('2020-01-29 10:00', 'Завтрак (User)', 1000, 100000),
('2020-01-29 13:00', 'Обед (User)', 500, 100000),
('2020-01-29 20:00', 'Ужин (User)', 410, 100000),

('2020-01-30 10:00', 'Завтрак (Admin)', 500, 100001),
('2020-01-30 13:00', 'Обед (Admin)', 1000, 100001),
('2020-01-30 20:00', 'Ужин (Admin)', 500, 100001),
('2020-01-31 00:00', 'Еда на граничное значение (Admin)', 100, 100001),
('2020-01-31 10:00', 'Завтрак (Admin)', 1000, 100001),
('2020-01-31 13:00', 'Обед (Admin)', 500, 100001),
('2020-01-31 20:00', 'Ужин (Admin)', 410, 100001),

('2020-01-28 10:00', 'Завтрак (Admin)', 500, 100001),
('2020-01-28 13:00', 'Обед (Admin)', 1000, 100001),
('2020-01-28 20:00', 'Ужин (Admin)', 500, 100001),
('2020-01-29 00:00', 'Еда на граничное значение (Admin)', 100, 100001),
('2020-01-29 10:00', 'Завтрак (Admin)', 1000, 100001),
('2020-01-29 13:00', 'Обед (Admin)', 500, 100001),
('2020-01-29 20:00', 'Ужин (Admin)', 410, 100001);